Microchip-MPLAB-Harmony/usb_apps_device/apps/cdc_com_port_single/firmware/src/packs/ATSAMA5D27CLD2G_DFP/component/spi.h
/* -------- SPI_FMR : (SPI Offset: 0x40) (R/W 32) FIFO Mode Register -------- */
#define SPI_FMR_TXRDYM_Pos                    _UINT32_(0)                                          /* (SPI_FMR) Transmit Data Register Empty Mode Position */
#define SPI_FMR_TXRDYM_Msk                    (_UINT32_(0x3) << SPI_FMR_TXRDYM_Pos)                /* (SPI_FMR) Transmit Data Register Empty Mode Mask */
#define SPI_FMR_TXRDYM(value)                 (SPI_FMR_TXRDYM_Msk & (_UINT32_(value) << SPI_FMR_TXRDYM_Pos)) /* Assigment of value for TXRDYM in the SPI_FMR register */
#define   SPI_FMR_TXRDYM_ONE_DATA_Val         _UINT32_(0x0)                                        /* (SPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO.  */
#define   SPI_FMR_TXRDYM_TWO_DATA_Val         _UINT32_(0x1)                                        /* (SPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if SPI_MR.PS =1.  */
#define SPI_FMR_TXRDYM_ONE_DATA               (SPI_FMR_TXRDYM_ONE_DATA_Val << SPI_FMR_TXRDYM_Pos)  /* (SPI_FMR) TDRE will be at level '1' when at least one data can be written in the Transmit FIFO. Position  */
#define SPI_FMR_TXRDYM_TWO_DATA               (SPI_FMR_TXRDYM_TWO_DATA_Val << SPI_FMR_TXRDYM_Pos)  /* (SPI_FMR) TDRE will be at level '1' when at least two data can be written in the Transmit FIFO. Cannot be used if SPI_MR.PS =1. Position  */
#define SPI_FMR_RXRDYM_Pos                    _UINT32_(4)                                          /* (SPI_FMR) Receive Data Register Full Mode Position */
#define SPI_FMR_RXRDYM_Msk                    (_UINT32_(0x3) << SPI_FMR_RXRDYM_Pos)                /* (SPI_FMR) Receive Data Register Full Mode Mask */
#define SPI_FMR_RXRDYM(value)                 (SPI_FMR_RXRDYM_Msk & (_UINT32_(value) << SPI_FMR_RXRDYM_Pos)) /* Assigment of value for RXRDYM in the SPI_FMR register */
#define   SPI_FMR_RXRDYM_ONE_DATA_Val         _UINT32_(0x0)                                        /* (SPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO.  */
#define   SPI_FMR_RXRDYM_TWO_DATA_Val         _UINT32_(0x1)                                        /* (SPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used if SPI_MR.PS =1.  */
#define   SPI_FMR_RXRDYM_FOUR_DATA_Val        _UINT32_(0x2)                                        /* (SPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when SPI_CSRx.BITS is greater than 0, or if SPI_MR.MSTR =1, or if SPI_MR.PS =1.  */
#define SPI_FMR_RXRDYM_ONE_DATA               (SPI_FMR_RXRDYM_ONE_DATA_Val << SPI_FMR_RXRDYM_Pos)  /* (SPI_FMR) RDRF will be at level '1' when at least one unread data is in the Receive FIFO. Position  */
#define SPI_FMR_RXRDYM_TWO_DATA               (SPI_FMR_RXRDYM_TWO_DATA_Val << SPI_FMR_RXRDYM_Pos)  /* (SPI_FMR) RDRF will be at level '1' when at least two unread data are in the Receive FIFO. Cannot be used if SPI_MR.PS =1. Position  */
#define SPI_FMR_RXRDYM_FOUR_DATA              (SPI_FMR_RXRDYM_FOUR_DATA_Val << SPI_FMR_RXRDYM_Pos) /* (SPI_FMR) RDRF will be at level '1' when at least four unread data are in the Receive FIFO. Cannot be used when SPI_CSRx.BITS is greater than 0, or if SPI_MR.MSTR =1, or if SPI_MR.PS =1. Position  */
#define SPI_FMR_TXFTHRES_Pos                  _UINT32_(16)                                         /* (SPI_FMR) Transmit FIFO Threshold Position */
#define SPI_FMR_TXFTHRES_Msk                  (_UINT32_(0x3F) << SPI_FMR_TXFTHRES_Pos)             /* (SPI_FMR) Transmit FIFO Threshold Mask */
#define SPI_FMR_TXFTHRES(value)               (SPI_FMR_TXFTHRES_Msk & (_UINT32_(value) << SPI_FMR_TXFTHRES_Pos)) /* Assigment of value for TXFTHRES in the SPI_FMR register */
#define SPI_FMR_RXFTHRES_Pos                  _UINT32_(24)                                         /* (SPI_FMR) Receive FIFO Threshold Position */
#define SPI_FMR_RXFTHRES_Msk                  (_UINT32_(0x3F) << SPI_FMR_RXFTHRES_Pos)             /* (SPI_FMR) Receive FIFO Threshold Mask */
#define SPI_FMR_RXFTHRES(value)               (SPI_FMR_RXFTHRES_Msk & (_UINT32_(value) << SPI_FMR_RXFTHRES_Pos)) /* Assigment of value for RXFTHRES in the SPI_FMR register */
#define SPI_FMR_Msk                           _UINT32_(0x3F3F0033)                                 /* (SPI_FMR) Register Mask  */


/* -------- SPI_FLR : (SPI Offset: 0x44) ( R/ 32) FIFO Level Register -------- */
#define SPI_FLR_TXFL_Pos                      _UINT32_(0)                                          /* (SPI_FLR) Transmit FIFO Level Position */
#define SPI_FLR_TXFL_Msk                      (_UINT32_(0x3F) << SPI_FLR_TXFL_Pos)                 /* (SPI_FLR) Transmit FIFO Level Mask */
#define SPI_FLR_TXFL(value)                   (SPI_FLR_TXFL_Msk & (_UINT32_(value) << SPI_FLR_TXFL_Pos)) /* Assigment of value for TXFL in the SPI_FLR register */
#define SPI_FLR_RXFL_Pos                      _UINT32_(16)                                         /* (SPI_FLR) Receive FIFO Level Position */
#define SPI_FLR_RXFL_Msk                      (_UINT32_(0x3F) << SPI_FLR_RXFL_Pos)                 /* (SPI_FLR) Receive FIFO Level Mask */
#define SPI_FLR_RXFL(value)                   (SPI_FLR_RXFL_Msk & (_UINT32_(value) << SPI_FLR_RXFL_Pos)) /* Assigment of value for RXFL in the SPI_FLR register */
#define SPI_FLR_Msk                           _UINT32_(0x003F003F)                                 /* (SPI_FLR) Register Mask  */


/* -------- SPI_CMPR : (SPI Offset: 0x48) ( R/ 32) Comparison Register -------- */
#define SPI_CMPR_VAL1_Pos                     _UINT32_(0)                                          /* (SPI_CMPR) First Comparison Value for Received Character Position */
#define SPI_CMPR_VAL1_Msk                     (_UINT32_(0xFFFF) << SPI_CMPR_VAL1_Pos)              /* (SPI_CMPR) First Comparison Value for Received Character Mask */
#define SPI_CMPR_VAL1(value)                  (SPI_CMPR_VAL1_Msk & (_UINT32_(value) << SPI_CMPR_VAL1_Pos)) /* Assigment of value for VAL1 in the SPI_CMPR register */
#define SPI_CMPR_VAL2_Pos                     _UINT32_(16)                                         /* (SPI_CMPR) Second Comparison Value for Received Character Position */
#define SPI_CMPR_VAL2_Msk                     (_UINT32_(0xFFFF) << SPI_CMPR_VAL2_Pos)              /* (SPI_CMPR) Second Comparison Value for Received Character Mask */
#define SPI_CMPR_VAL2(value)                  (SPI_CMPR_VAL2_Msk & (_UINT32_(value) << SPI_CMPR_VAL2_Pos)) /* Assigment of value for VAL2 in the SPI_CMPR register */
#define SPI_CMPR_Msk                          _UINT32_(0xFFFFFFFF)                                 /* (SPI_CMPR) Register Mask  */


/* -------- SPI_WPMR : (SPI Offset: 0xE4) (R/W 32) Write Protection Mode Register -------- */
#define SPI_WPMR_WPEN_Pos                     _UINT32_(0)                                          /* (SPI_WPMR) Write Protection Enable Position */
#define SPI_WPMR_WPEN_Msk                     (_UINT32_(0x1) << SPI_WPMR_WPEN_Pos)                 /* (SPI_WPMR) Write Protection Enable Mask */
#define SPI_WPMR_WPEN(value)                  (SPI_WPMR_WPEN_Msk & (_UINT32_(value) << SPI_WPMR_WPEN_Pos)) /* Assigment of value for WPEN in the SPI_WPMR register */
#define SPI_WPMR_WPKEY_Pos                    _UINT32_(8)                                          /* (SPI_WPMR) Write Protection Key Position */
#define SPI_WPMR_WPKEY_Msk                    (_UINT32_(0xFFFFFF) << SPI_WPMR_WPKEY_Pos)           /* (SPI_WPMR) Write Protection Key Mask */
#define SPI_WPMR_WPKEY(value)                 (SPI_WPMR_WPKEY_Msk & (_UINT32_(value) << SPI_WPMR_WPKEY_Pos)) /* Assigment of value for WPKEY in the SPI_WPMR register */
#define   SPI_WPMR_WPKEY_PASSWD_Val           _UINT32_(0x535049)                                   /* (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.  */
#define SPI_WPMR_WPKEY_PASSWD                 (SPI_WPMR_WPKEY_PASSWD_Val << SPI_WPMR_WPKEY_Pos)    /* (SPI_WPMR) Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0. Position  */
#define SPI_WPMR_Msk                          _UINT32_(0xFFFFFF01)                                 /* (SPI_WPMR) Register Mask  */


/* -------- SPI_WPSR : (SPI Offset: 0xE8) ( R/ 32) Write Protection Status Register -------- */
#define SPI_WPSR_WPVS_Pos                     _UINT32_(0)                                          /* (SPI_WPSR) Write Protection Violation Status Position */
#define SPI_WPSR_WPVS_Msk                     (_UINT32_(0x1) << SPI_WPSR_WPVS_Pos)                 /* (SPI_WPSR) Write Protection Violation Status Mask */
#define SPI_WPSR_WPVS(value)                  (SPI_WPSR_WPVS_Msk & (_UINT32_(value) << SPI_WPSR_WPVS_Pos)) /* Assigment of value for WPVS in the SPI_WPSR register */
#define SPI_WPSR_WPVSRC_Pos                   _UINT32_(8)                                          /* (SPI_WPSR) Write Protection Violation Source Position */
#define SPI_WPSR_WPVSRC_Msk                   (_UINT32_(0xFF) << SPI_WPSR_WPVSRC_Pos)              /* (SPI_WPSR) Write Protection Violation Source Mask */
#define SPI_WPSR_WPVSRC(value)                (SPI_WPSR_WPVSRC_Msk & (_UINT32_(value) << SPI_WPSR_WPVSRC_Pos)) /* Assigment of value for WPVSRC in the SPI_WPSR register */
#define SPI_WPSR_Msk                          _UINT32_(0x0000FF01)                                 /* (SPI_WPSR) Register Mask  */


